In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [30]:
df = pd.read_csv("data.csv",index_col='ID')

In [31]:
df = df[['Name','Flag','Club','Wage','Height','Weight']]

In [32]:
df = df.reset_index()

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18207 entries, 0 to 18206
Data columns (total 7 columns):
ID        18207 non-null int64
Name      18207 non-null object
Flag      18207 non-null object
Club      17966 non-null object
Wage      18207 non-null object
Height    18159 non-null object
Weight    18159 non-null object
dtypes: int64(1), object(6)
memory usage: 995.8+ KB

In [34]:
df.head(2)

,ID,Name,Flag,Club,Wage,Height,Weight
0,158023,L. Messi,https://cdn.sofifa.org/flags/52.png,FC Barcelona,€565K,5'7,159lbs
1,20801,Cristiano Ronaldo,https://cdn.sofifa.org/flags/38.png,Juventus,€405K,6'2,183lbs

In [35]:
df['Weight'] = df['Weight'].apply(lambda x: str(x)[0:-3])
df['Weight'] = pd.to_numeric(df['Weight'])

In [45]:
df['Wage'] = df['Wage'].apply(lambda x: x[1:-1])
df['Wage'] = pd.to_numeric(df['Wage'])

In [49]:
df['Wage'] = df['Wage'] * 1000

In [53]:
df['FlagId'] = df['Flag'].str[-6:-4]

In [57]:
df['FlagId'] = df['FlagId'].str.replace("/","")

In [59]:
df['FlagId'] = pd.to_numeric(df['FlagId'])

In [61]:
df['FlagId'] = df['FlagId'].astype(int)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18207 entries, 0 to 18206
Data columns (total 8 columns):
ID        18207 non-null int64
Name      18207 non-null object
Flag      18207 non-null object
Club      17966 non-null object
Wage      17966 non-null float64
Height    18159 non-null object
Weight    18159 non-null float64
FlagId    18207 non-null int64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.1+ MB

In [66]:
df.drop('Flag',axis=1,inplace=True)

In [67]:
df

,ID,Name,Club,Wage,Height,Weight,FlagId
0,158023,L. Messi,FC Barcelona,565000.0,5'7,159.0,52
1,20801,Cristiano Ronaldo,Juventus,405000.0,6'2,183.0,38
2,190871,Neymar Jr,Paris Saint-Germain,290000.0,5'9,150.0,54
3,193080,De Gea,Manchester United,260000.0,6'4,168.0,45
4,192985,K. De Bruyne,Manchester City,355000.0,5'11,154.0,7
...,...,...,...,...,...,...,...
18202,238813,J. Lundstram,Crewe Alexandra,1000.0,5'9,134.0,14
18203,243165,N. Christoffersson,Trelleborgs FF,1000.0,6'3,170.0,46
18204,241638,B. Worman,Cambridge United,1000.0,5'8,148.0,14
18205,246268,D. Walker-Rice,Tranmere Rovers,1000.0,5'10,154.0,14
18206,246269,G. Nugent,Tranmere Rovers,1000.0,5'10,176.0,14

In [68]:
df.dropna(inplace=True)

In [69]:
df

,ID,Name,Club,Wage,Height,Weight,FlagId
0,158023,L. Messi,FC Barcelona,565000.0,5'7,159.0,52
1,20801,Cristiano Ronaldo,Juventus,405000.0,6'2,183.0,38
2,190871,Neymar Jr,Paris Saint-Germain,290000.0,5'9,150.0,54
3,193080,De Gea,Manchester United,260000.0,6'4,168.0,45
4,192985,K. De Bruyne,Manchester City,355000.0,5'11,154.0,7
...,...,...,...,...,...,...,...
18202,238813,J. Lundstram,Crewe Alexandra,1000.0,5'9,134.0,14
18203,243165,N. Christoffersson,Trelleborgs FF,1000.0,6'3,170.0,46
18204,241638,B. Worman,Cambridge United,1000.0,5'8,148.0,14
18205,246268,D. Walker-Rice,Tranmere Rovers,1000.0,5'10,154.0,14
18206,246269,G. Nugent,Tranmere Rovers,1000.0,5'10,176.0,14

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17918 entries, 0 to 18206
Data columns (total 7 columns):
ID        17918 non-null int64
Name      17918 non-null object
Club      17918 non-null object
Wage      17918 non-null float64
Height    17918 non-null object
Weight    17918 non-null float64
FlagId    17918 non-null int64
dtypes: float64(2), int64(2), object(3)
memory usage: 1.1+ MB

In [ ]:
%matplotlib inline
sns.countplot(x='Club',data=df)
plt.show()